In [1]:
import pandas as pd
import numpy as np

In [2]:
data=np.array([[1,2],[3,4],[5,6]])

In [ ]:
df=pd.DataFrame(data, index=['row1','row2','row3'],columns=['col1','col2'])

      col1  col2
row1     1     2
row2     3     4
row3     5     6

In [5]:
states=['Lahore','Karachi','Peshawer','Islamabad']
population=[123424,5690394,2345984,293049]

dic={"States":states,"Population":population}

df_population=pd.DataFrame(dic)

In [6]:
df_population

      States  Population
0     Lahore      123424
1    Karachi     5690394
2   Peshawer     2345984
3  Islamabad      293049

In [7]:
mark=pd.read_csv('StudentsPerformance.csv')

In [8]:
mark.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [9]:
mark.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [10]:
mark.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [11]:
mark.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [12]:
mark['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object